Repository: apluslms/mooc-grader
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: Submit at least %(num_files)s of the following files.
fi: Palauta ainakin %(num_files)s seuraavista tiedostoista.

source: Can contain an integer number
fi: Voi sisältää kokonaisluvun

source: Can contain a decimal number
fi: Voi sisältää liukuluvun

source: Content must match regular expression '%(pattern)s'
fi: Sisällön tulee vastata säännöllistä lauseketta '%(pattern)s'

source: This field is required
fi: Kenttä on pakollinen

source: Current content is not acceptable
fi: Nykyinen sisältö ei kelpaa

source: Submit
fi: Lähetä

source: Enter your Git repository address for grading
fi: Syötä arvosteltavan projektisi Git-osoite

source: Did you remember git add - git commit - git push?
fi: Muistitko git add - git commit - git push?

source: Enter your user id for grading
fi: Anna käyttäjätunnuksesi arvostelua varten

source: Request grading of my repository
fi: Pyydä versiosäilöni arvostelua

source: Points %(points)s/%(max_points)s
fi: Pisteet %(points)s/%(max_points)s

source: You got %(points)s/%(max_points)s for your answer.
fi: Sait %(points)s/%(max_points)s pistettä vastauksestasi.

source: The grading queue is not configured. This submission was graded synchronously while blocking other services. NOT READY FOR PRODUCTION!
fi: Arvostelujonoa ei ole konfiguroitu. Tämä palautus arvosteltiin synkronisesti, mikä estää muita palveluja toimimasta samaan aikaan. EI VALMIS TUOTANTOKÄYTTÖÖN!

source: Submission failed
fi: Palautuksen vastaanottaminen epäonnistui

source: Error occurred while handling the submission. Please, contact course staff.
fi: Palautuksen käsittelyssä tapahtui virhe. Ota yhteys kurssihenkilökuntaan.

source: Submission accepted
fi: Palautus on vastaanotettu

source: Missing the <code>%(key)s</code> for result delivery! The result can be temporarily seen at <a href="%(url)s">%(url)s</a>.
fi: <code>%(key)s</code> puuttuu ja se vaaditaan tulosten toimittamiseen! Tuloksia voi väliaikaisesti katsella osoitteessa <a href="%(url)s">%(url)s</a>.

source: Your submission is being graded. The result will be available on this page when the grading process completes. Note that grading may take a while. You might also need to update the page manually in order to see the results.
fi: Palautuksesi on arvosteltavana. Tulos on mahdollista nähdä tällä sivulla, kun arvosteluprosessi on suoritettu loppuun. Huomioi, että arvostelu voi kestää useita kymmeniä sekunteja. Voit lisäksi joutua lataamaan tämän sivun uudestaan nähdäksesi palautteen.

source: Your submission is in the grading queue. There are %(queue)s other submissions before. The result will be available on this page when the grading process completes. The page must be updated manually to see the results.
fi: Palautuksesi on arvostelujonossa. Jonossa on edellä %(queue)s palautusta. Tulos näytetään tällä sivulla, kun arvosteluprosessi on suoritettu. Joudut lataamaan sivun uudelleen nähdäksesi palautteen.

source: Back to the course list
fi: Takaisin kurssilistaukseen

source: Service URLs for A+
fi: Palveluosoitteet A+:aa varten

source: A+ configuration JSON
fi: A+:n konfiguraatio-JSON

source: Build/make output retrieval
fi: Kurssin kääntämisen tulosteen haku

source: Requires the gitmanager plugin
fi: Vaatii gitmanager-liitännäisen

source: Available exercises
fi: Saatavilla olevat tehtävät

source: You got %(points)s/%(max_points)s points from this questionnaire.
fi: Sait %(points)s/%(max_points)s pistettä tästä tehtävästä.

source: Note that the whole section of questions is marked as being incorrect if one of the questions in that section is incorrect.
fi: Huomaa, että koko kysymysosio merkitään virheelliseksi, jos yksikin osion vastauksista on virheellinen.

source: You can change your answers and submit them for regrading. However, notice the number of allowed submissions left!
fi: Voit vaihtaa vastauksiasi ja lähettää ne uudelleen arvosteltavaksi. Huomaa kuitenkin jäljellä olevien palautuskertojen määrä!

source: The exercise configuration has an error. Please, notify the course staff and provide the following message:
fi: Tehtävän asetuksissa on virhe. Ole ystävällinen ja ilmoita asiasta henkilökunnalle. Liitä mukaan seuraava viesti:

source: Submission was not accepted for grading
fi: Palautusta ei hyväksytty arvioitavaksi

source: You must submit at least %(num_files)s file.
fi: Sinun täytyy palauttaa ainakin %(num_files)s tiedosto.

source: Every file is required for a submission.
fi: Palautus vaatii kaikki tiedostot.

source: Invalid address entered.
fi: Syötetty osoite ei kelpaa.

source: Some required fields are empty or content of some fields is not acceptable
fi: Jotkin pakolliset kentän ovat tyhjiä tai joidenkin kenttien sisältö ei kelpaa

source: Missing or invalid checksum. Do not tamper with the hidden form fields!
fi: Tarkistesumma puuttuu tai on epäkelpo. Älä muokkaa lomakkeen piilotettuja kenttiä!

source: <p> The feedback template did not access the <code>result</code> dict. This means that the feedback shown below is likely inadequate or missing. The template should access at least one of <code>points</code>, <code>max_points</code>, <code>error</code> or <code>out</code>. Please check the <code>feedback_template</code> specified in the exercise YAML. </p><p> If you are a student, please tell course staff what you were doing before you got this message, and the content of this message. </p>
fi: <p> Palaute-template ei käyttänyt <code>result</code>-dictiä, joten alla oleva palaute luultavasti puuttuu tai on puutteellinen Templaten tulisi käyttää lukea ainakin <code>points</code>, <code>max_points</code>, <code>error</code> tai <code>out</code>. Ole hyvä ja tarkista tehtävän YAML-tiedostossa määritelty <code>feedback_template</code> </p><p> Jos olet opiskelija, ole hyvä ja kerro kurssihenkilökunnalle mitä olit tekemässä viestin saadessasi, sekä tämän viestin sisältö. </p>

source: Incorrect
fi: Väärin

source: Correct
fi: Oikein

source: %(points)s point
fi: %(points)s piste

source: Correct answer
fi: Oikea vastaus

source: Download
fi: Lataa

source: Grader ready
fi: Arvostelija on valmiina

source: Git manager
fi: Git-hallinnointi

source: Available courses
fi: Saatavilla olevat kurssit

source: Total points %(points)s/%(max_points)s
fi: Kokonaispisteet %(points)s/%(max_points)s

source: Appendixes
fi: Liitteet

source: Internal server error
fi: Järjestelmävirhe

source: Ooops, there seems to be problems in the system! Sorry for your inconvenience. Please try again later or contact course support.
fi: Hups, järjestelmässä näyttää olevan ongelmia! Pahoittelemme häiriötä. Yritä myöhemmin uudelleen tai ota yhteyttä kurssihenkilökuntaan.

source: Time out while grading
fi: Arvostelu katkaistiin

source: Ooops, the grading of your submission timed out! Sorry for your inconvenience. Please try again later or contact course support.
fi: Hups, palautuksesi arvostelu kesti yli maksimiajan! Pahoittelemme häiriötä. Yritä myöhemmin uudelleen tai ota yhteyttä kurssihenkilökuntaan.

source: Multiple choices are selectable.
fi: Voit valita useita vaihtoehtoja.

source: Multiple correct answers accepted.
fi: Useita oikeita vastauksia.

source: Correct parts in your answer:
fi: Oikeat osat vastauksessasi:
